app/controllers/todos_controller.rb

	def create
		@todo = Todo.create(todo_params)
---
INSERT INTO "todos" ("name", "time_to_complete", "level_of_difficulty", "completed") VALUES (?, ?, ?, ?)  [["name", "tester"], ["time_to_complete", "an hour or less"], ["level_of_difficulty", "a little bit"], ["completed", 0]]

	def update
		@todo = Todo.find(params[:id])
		@todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = ? WHERE "todos"."id" = ?  [["completed", 1], ["id", 1]]

	def destroy
		@todo = Todo.find(params[:id])
		@todos = Todo.all
		@todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "todos".* FROM "todos"
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]